Process.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<div style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="http://www.debian.org/"> UP </a>
 |
 <a accesskey="H" href="http://wiki.debian.org/Teams/Policy"> HOME </a>
</div>

<title>Debian Policy changes process</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009-09-13 16:13:52 CDT"/>
<meta name="author" content="Margarita Manterola, Clint Adams, Russ Allbery, and Manoj Srivastava"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>


</head>
<body>
<div id="content">
<h1 class="title">Debian Policy changes process</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Change Goals </h2>
<div class="outline-text-2" id="text-1">


<ul>
<li>
The change should be technically correct, and consistent with the
rest of the policy document. This means no legislating the value of
π. This also means that the proposed solution be known to work;
iterative design processes do not belong in policy.
</li>
<li>
The change should not be too disruptive; if very many packages
become instantly buggy, then instead there should be a transition
plan. Exceptions should be rare (only if the current state is really
untenable), and probably blessed by the TC.
</li>
<li>
The change has to be reviewed in depth, in the open, where any one
may contribute; a publicly accessible, archived, open mailing list.
</li>
<li>
Proposal should be addressed in a timely fashion.
</li>
<li>
Any domain experts should be consulted, since not every policy
mailing list subscriber is an expert on everything, including policy
maintainers.
</li>
<li>
The goal is rough consensus on the change, which should not be hard
if the matter is technical. Technical issues where there is no
agreement should be referred to the TC; non-technical issues should
be referred to the whole developer body, and perhaps general
resolutions lie down that path.
</li>
<li>
Package maintainers whose packages may be impacted should have
access to policy change proposals, even if they do not subscribe to
policy mailing lists (policy gazette?).

</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Current Process </h2>
<div class="outline-text-2" id="text-2">


<p>
Each suggested change goes through different states. These states are
denoted through either usertags of the
<a href="mailto:debian-policy@packages.debian.org">debian-policy@packages.debian.org</a> user or, for patch, pending, and
wontfix, regular tags.
</p>
<p>
<a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?src=debian-policy&amp;pend-exc=done">Current list of bugs</a>
</p>
<p>
The Policy delegates are responsible for managing the tags on bugs and
will update tags as new bugs are submitted or as activity happens on
bugs. All Debian Developers should feel free to add the seconded tag
as described below. Other tags should be changed with the coordination
of the Policy Team.
</p>

</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1">State A: Issue raised </h3>
<div class="outline-text-3" id="text-2.1">


<p>
Detect need, like gaps/flaws in current policy, or a new rule should
be added. Any user or developer may start this step. There is a
decision point here, not all issues are in scope of policy.
<a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?src=debian-policy&amp;tag=issue">TAG: issue</a>
</p>
<p>
What needs to happen next: If this is in scope for Policy, discuss the
issue and possible solutions, moving to the discussion tag, or if the
matter is sufficiently clear, go directly to a proposal for how to
address it, moving to the proposal tag. If this is not in scope for
Policy, close the bug.
</p>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2">State B: Discussion </h3>
<div class="outline-text-3" id="text-2.2">


<p>
Discuss remedy. Alternate proposals. Discussion guided by
delegates. There should be a clear time limit to this stage, but as
yet we have not set one.
<a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?src=debian-policy&amp;pend-exc=done&amp;tag=discussion">TAG: discussion</a>
</p>
<p>
What needs to happen next: Reach a conclusion and consensus in the
discussion and make a final proposal for what should be changed (if
anything), moving to the proposal tag.
</p>
</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3">State D: Proposal </h3>
<div class="outline-text-3" id="text-2.3">


<p>
A final proposal has emerged from the discussion, and there is a rough
consensus on how to proceed to resolve the issue. 
<a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?src=debian-policy&amp;pend-exc=done&amp;tag=proposal">TAG: proposal</a>
</p>
<p>
What needs to happen next: Provided that the rough consensus persists,
develop a patch against the current Policy document with specific
wording of the change. Often this is done in conjunction with the
proposal, in which case one may skip this step and move directly to
patch tag.
</p>
</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4">State E: Wording proposed </h3>
<div class="outline-text-3" id="text-2.4">


<p>
A patch against the Policy document reflecting the consensus has been
created and is waiting for formal seconds. The standard patch tag is
used for this state, since it's essentially equivalent to the standard
meaning of that tag. 
<a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?src=debian-policy&amp;pend-exc=done&amp;tag=patch">TAG: patch</a>
</p>
<p>
What needs to happen next: The proposal needs to be reviewed and
seconded. Any Debian developer who agrees with the change and the
conclusion of rough consensus from the discussion should say so in the
bug log by seconding the proposal.
</p>
</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5">State F: Seconded </h3>
<div class="outline-text-3" id="text-2.5">


<p>
The proposal is signed off on by N Debian Developers. To start with,
we're going with N=3, meaning that if three Debian Developers agree,
not just with the proposal but with the conclusion that it reflects
consensus and addresses the original issue &ndash; it is considered
eligible for inclusion in the next version of Policy. Since Policy is
partly a technical project governance method, one must be a Debian
Developer to formally second, although review and discussion is
welcome from anyone. Once this tag has been applied, the bug is
waiting for a Policy team member to apply the patch to the package
repository. 
<a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?src=debian-policy&amp;pend-exc=done&amp;tag=seconded">TAG: seconded</a>
</p>
<p>
What needs to happen next: A Policy maintainer does the final review
and confirmation, and then applies the patch for the next Policy
release.
</p>
<p>
This tag is not used very much because normally a Policy maintainer
applies the patch and moves the proposal to the next state once enough
seconds are reached.
</p>
</div>

</div>

<div id="outline-container-2.6" class="outline-3">
<h3 id="sec-2.6">State G: Accepted </h3>
<div class="outline-text-3" id="text-2.6">


<p>
Change accepted, will be in next upload. The standard pending tag is
used for this state since it matches the regular meaning of
pending. 
<a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?src=debian-policy&amp;pend-exc=done&amp;tag=pending">TAG: pending</a>
</p>
<p>
What needs to happen next: The bug is now in the waiting queue for the
next Policy release, and there's nothing left to do except for upload
a new version of Policy.
</p>
</div>

</div>

<div id="outline-container-2.7" class="outline-3">
<h3 id="sec-2.7">State H: Reject </h3>
<div class="outline-text-3" id="text-2.7">


<p>
Rejected proposals. The standard wontfix is used for this
state. Normally, bugs in this state will not remain open; instead, a
Policy team member will close them with an explanation. The submitter
may then appeal to the tech-ctte if they so desire. Alternately,
issues appealed to the tech-ctte may remain open with this tag while
that appeal proceeds.
<a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?src=debian-policy&amp;pend-exc=done&amp;tag=rejected">TAG: wontfix</a>
</p>
<p>
We may use one of the following tags here, but to date we have only
used dubious and ctte. It's not clear whether we need more tags for
this tage.
</p>
<dl>
<dt><b>dubious</b></dt><dd>
Not a policy matter 
</dd>
<dt><b>ctte</b></dt><dd>
Referred to the Technical Committee (tech-ctte) 
</dd>
<dt><b>devel</b></dt><dd>
Referred to the developer body 
</dd>
<dt><b>delegate</b></dt><dd>
Rejected by a Policy delegate 
</dd>
<dt><b>obsolete</b></dt><dd>
The proposal timed out without a conclusion 

</dd>
</dl>

<p>What needs to happen next: The bug should be closed once a final
resolution is reached, or retagged to an appropriate state if that
final resolution reverses the decision to reject the proposal.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Other Tags </h2>
<div class="outline-text-2" id="text-3">


<p>
All Policy bugs are additionally categorized by class of bug.
</p>
<p>
The normative tag is used for bugs that make normative changes to
Policy, meaning that the dictates of Policy will change in some
fashion as part of the resolution of the bug if the proposal is
accepted. The full process is followed for such bugs. 
<a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?src=debian-policy&amp;pend-exc=done&amp;tag=normative">TAG: normative</a>
</p>
<p>
The informative tag is used for bugs about wording issues, typos,
informative footnotes, or other changes that do not affect the formal
dictates of Policy, just the presentation. The same tags are used for
these bugs for convenience, but the Policy maintainers may make
informative changes without following the full process. Informative
bugs fall under their discretion. 
<a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?src=debian-policy&amp;pend-exc=done&amp;tag=informative">TAG: informative</a>
</p>
<p>
The packaging tag is used for bugs about the packaging and build
process of the debian-policy Debian package. These bugs do not follow
the normal process and will not have the other tags except for pending
and wontfix (used with their normal meanings). 
<a href="http://bugs.debian.org/cgi-bin/pkgreport.cgi?src=debian-policy&amp;pend-exc=done&amp;tag=packaging">TAG: packaging</a>
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Margarita Manterola, Clint Adams, Russ Allbery, and Manoj Srivastava
<a href="mailto:srivasta@debian.org">&lt;srivasta@debian.org&gt;</a>
</p>
<p class="date"> Date: 2009-09-13 16:13:52 CDT</p>
<p class="creator">HTML generated by org-mode 6.30trans in emacs 23</p>
</div>
</div>
</body>
</html>
